run/ghost_effect/asymptotic_eqns/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gamma1           gamma1  [ 0 2 -1 -1.5 0 0 0 ] 1.270042;
gamma2           gamma2  [ 0 2 -1 -1.5 0 0 0 ] 1.922284;
gamma7           gamma7  [ 0 4 -2   -3 0 0 0 ] 1.758705;

// ************************************************************************* //
